---
kind: other
id: Methods.T:Autodesk.Revit.UI.Selection.SelectableInViewFilter
source: html/9d1d37f1-8815-f079-daf2-64995ad3f83a.htm
---
# SelectableInViewFilter Methods

Applies the filter to a given element.